.doom.d/config.org
#+title: Doom Emacs Config
#+PROPERTY: header-args :tangle config.el

* TABLE OF CONTENTS :toc:
- [[#intro][Intro]]
  - [[#fonts][Fonts]]
  - [[#themes][Themes]]
  - [[#line-numbers][Line Numbers]]
  - [[#line-breaking][Line Breaking]]
  - [[#transparency][Transparency]]
  - [[#icons][Icons]]
- [[#colemak-mod-dh][Colemak Mod-DH]]
- [[#org-mode][Org-Mode]]
  - [[#org-roam][Org-Roam]]
  - [[#org-latex][Org-Latex]]
- [[#latex-config][LaTeX Config]]
  - [[#bibtex][Bibtex]]
  - [[#snippets][Snippets]]
  - [[#cd-latex][CD-Latex]]
  - [[#folding][Folding]]
- [[#dashboard][Dashboard]]
- [[#dired-ibuffer-sidebar][Dired-iBuffer sidebar]]
- [[#smaller-packages][Smaller Packages]]
  - [[#evil-goggles][Evil Goggles]]
  - [[#daemon][Daemon]]
  - [[#company][Company]]
  - [[#ispell][iSpell]]
  - [[#toggling][Toggling]]
  - [[#openers][Openers]]
  - [[#rainbow-mode][Rainbow Mode]]
  - [[#evil-snipe][Evil Snipe]]
  - [[#other][Other]]

* Intro
Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets. It is optional.
#+begin_src elisp
(setq user-full-name "Lucas Kerbs"
      user-mail-address "lucaskerbs@gmail.com")
(setq default-directory "~/Dropbox/Graduate School/")
#+end_src

** Fonts
Doom exposes five (optional) variables for controlling fonts in Doom:
 - `doom-font' -- the primary font to use
 - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
 - `doom-big-font' -- used for `doom-big-font-mode'; use this for
   presentations or streaming.
 - `doom-unicode-font' -- for unicode glyphs
 - `doom-serif-font' -- for the `fixed-pitch-serif' face
#+begin_src elisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 14)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

** Themes
#+begin_src elisp
(setq doom-theme 'doom-monokai-pro)
;;(setq doom-theme 'doom-horizon)
(require 'ewal-doom-themes)
#+end_src

We also want some nice synatx highlighting!
#+begin_src elisp
(use-package! tree-sitter
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))
#+end_src

** Line Numbers
This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.
#+begin_src elisp
(setq display-line-numbers-type 'relative)
#+end_src

** Line Breaking
Break lines (in general text-based documents) automatically at 80-ish lines
#+begin_src elisp
(add-hook 'text-mode-hook  'auto-fill-mode)
(setq-default fill-column 80)
#+end_src

** Transparency
Set the default transparency for active and inactive frames
#+begin_src elisp
(set-frame-parameter (selected-frame) 'alpha '(90 . 75))
(add-to-list 'default-frame-alist '(alpha . (90 . 75)))
#+end_src

** Icons
We want lots of icons!
#+begin_src elisp
(use-package all-the-icons
  :if (display-graphic-p))
;;(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+end_src
* Colemak Mod-DH
~evil-colemak-basics~ remaps a number standard evil keymaps. It doesn't play nice
with ~evil-tex~ so first we need some code for that. This code was given from
[[https://github.com/iyefrat/evil-tex/issues/14][Issue 9]] on the ~evil-tex~ page
#+begin_src elisp
(setq evil-tex-toggle-override-m nil)

(with-eval-after-load 'evil-tex
  (evil-define-key 'normal evil-tex-mode-map [remap evil-set-marker]
    (evil-tex-dispatch-single-key ?t #'evil-tex-read-and-execute-toggle
                                  'evil-tex-m-functions)))
#+end_src

Now we load ~evil-colemak-basics~ and create commads so that I can use the
=m-n-e-i= movements between windows
#+begin_src elisp
(require 'evil-colemak-basics)
(use-package evil-colemak-basics
  :config
  (global-evil-colemak-basics-mode)
  )
  (define-key evil-window-map "n" 'evil-window-down)
  (define-key evil-window-map "N" 'evil-window-move-very-bottom)
  (define-key evil-window-map (kbd "C-S-n") 'evil-window-move-very-bottom)
  (define-key evil-window-map "e" 'evil-window-up)
  (define-key evil-window-map "E" 'evil-window-move-very-top)
  (define-key evil-window-map (kbd "C-S-e") 'evil-window-move-very-top)
  (define-key evil-window-map "m" 'evil-window-left)
  (define-key evil-window-map "M" 'evil-window-move-far-left)
  (define-key evil-window-map (kbd "C-S-m") 'evil-window-move-far-left)
  (define-key evil-window-map "i" 'evil-window-right)
  (define-key evil-window-map "I" 'evil-window-move-far-right)
  (define-key evil-window-map (kbd "C-S-i") 'evil-window-move-far-right)
  ;; Kreate new window
  (define-key evil-window-map "k" 'evil-window-new)
  (define-key evil-window-map "\C-k" 'evil-window-new)
#+end_src

* Org-Mode
First we set the default Directories for ~org~ and ~org-roam~
#+begin_src elisp
(setq org-directory "~/Dropbox/Slipbox/")
(setq org-roam-directory "~/Dropbox/Slipbox/")
#+end_src

** Org-Roam

First configure how often org-roam updates itself and the set the default header
for new org-roam documents
#+begin_src elisp
(setq org-roam-db-update-method 'immediate)
(setq org-roam-capture-templates '(("d" "default" plain "%?"
    :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                               "#+title: ${title}\n")
                                :unnarrowed t)))
#+end_src

Next we configure the side-window that is avaliable in org-roam buffers
#+begin_src elisp
(add-to-list 'display-buffer-alist
    '("\\*org-roam\\*"
        (display-buffer-in-side-window)
        (side . right)
        (slot . 0)
        (window-width . 0.25)
        (preserve-size . (t . nil))
        (window-parameters . ((no-other-window . t)
                              (no-delete-other-windows . t)))))
;; (setq org-roam-buffer nil)
#+end_src

** Org-Latex
We want ~cd-latex~ commands avaliable in ~org-mode~ as well as nicer latex highlighting
#+begin_src elisp
(add-hook 'org-mode-hook 'turn-on-org-cdlatex)
 (setq org-highlight-latex-and-related '(latex script entities))
#+end_src

Now turn on ~yas-snippets~ for LaTeX mode in org-buffers
#+begin_src elisp
(defun my-org-latex-yas ()
  (yas-minor-mode)
  (yas-activate-extra-mode 'latex-mode))
(add-hook 'org-mode-hook #'my-org-latex-yas)
#+end_src

Finally, we use ~org-fragtog~ to make the LaTeX snippets automatically toggle
previews
#+begin_src elisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
#+end_src

* LaTeX Config
First we make all the TeX-modes play nice
#+begin_src elisp
(require 'latex)
(add-hook 'latex-mode-hook #'TeX-latex-mode)
#+end_src

I don't like it when emacs adds the braces whenever I add =^= or =_= so that
gets disabled here.
#+begin_src elisp
(setq TeX-electric-sub-and-superscript nil)
#+end_src

** Bibtex
Eventually I'm sure there will be lost more that has to do with my Bibtex
information. For now there is just setting the link to my main =.bib= file
#+begin_src elisp
(setq bibtex-completion-bibliography '("~/Dropbox/Biblio/main.bib"))
#+end_src

When searching with =ivy-bibtex=, we want hitting =RET= on a paper to inset the
LaTeX citation
#+begin_src elisp
(setq ivy-bibtex-default-action 'ivy-bibtex-insert-citation)
#+end_src

** Snippets
This gets certain snippets to expand automatically. Honestly I stole if from
somewher and don't remember where/why.
#+begin_src elisp
(defun my-yas-try-expanding-auto-snippets ()
    (when (and (boundp 'yas-minor-mode) yas-minor-mode)
      (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
        (yas-expand))))
  (add-hook 'post-command-hook #'my-yas-try-expanding-auto-snippets)
#+end_src

The package ~laas~ or =latex-auto-activating-snippets= provides the ability to
automatically expand certain snippets with minimal/no input from me.
#+begin_src elisp
(use-package! laas
  :hook (LaTeX-mode . laas-mode)
  ;; if you want it in org-mode too
  :hook (org-mode . laas-mode)
  :config
  (aas-set-snippets 'laas-mode
                    ;; set condition!
                    :cond #'texmathp ; expand only while in math
                    ;;"supp" "\\supp"
                    ;; bind to functions!
                    ;;        (yas-expand-snippet "\\frac{$1}{$2}$0"))
                    "Span" (lambda () (interactive)
                             (yas-expand-snippet "\\Span($1)$0"))))
#+end_src

** CD-Latex
~cd-latex~ is a package that turn the =`= key into a leader key for a bunch of
LaTeX commads. By default Doom turns off it overloading =TAB=, but I've grown
used to it:
#+begin_src elisp
(map! :map cdlatex-mode-map
    :i "TAB" #'cdlatex-tab)
#+end_src

Now we add to the settings under the =`= leader:
#+begin_src elisp
(setq cdlatex-math-symbol-alist
 '(
   ( ?c  ("\\chi"                 "\\circ"                "\\cos"))
   ( ?e  ("\\varepsilon"          "\\epsilon"             "\\exp"))
   ( ?+  ("\\cup"                 "\\oplus"               ""))
   ( ?x  ("\\xi"                  "\\otimes"              ""))
    ))
#+end_src

