.doom.d/config.org
** Company
Comany is a completion engine. It is really nice but it gets in the way
#+begin_src elisp
(after! company
  (setq company-idle-delay 1.5
       company-minimum-prefix-length 5))
#+end_src

** iSpell
Spell-check needs a home
#+begin_src elisp
(setq ispell-program-name "/usr/local/bin/ispell")
#+end_src

** Toggling
Some simple code that adds things under ~leader-t~ to toggle various things
(once again, this code is stolen and I'm not 100% sure everything it does)
#+begin_src elisp
(map! :leader
      :desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      (:prefix ("t" . "toggle")
       :desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines))
#+end_src

** Openers
Keybindings to open files that I work with all the time using the find-file
command, which is the interactive file search that opens with ~C-x C-f~ in GNU
Emacs or ~SPC f f~ in Doom Emacs.  These keybindings use find-file
non-interactively since we specify exactly what file to open.  The format I use
for these bindings is ~SPC =~ plus ~key~ since Doom Emacs does not use ~SPC =~.
#+begin_src elisp
(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file" "a" #'(lambda () (interactive) (find-file "~/Org/agenda.org"))
       :desc "Edit doom config.org" "c" #'(lambda () (interactive) (find-file "~/.doom.d/config.org"))
       :desc "Edit doom init.el" "i" #'(lambda () (interactive) (find-file "~/.doom.d/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.doom.d/packages.el"))))
#+end_src

** Rainbow Mode
Get those good good colors!
#+begin_src elisp
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda () (rainbow-mode 1)))
(global-rainbow-mode 1 )
#+end_src

** Evil Snipe
This is a new thing (as of 4-9-22). It seems like a good way to navigate round
the buffer but I want a little larger range for my sniping
#+begin_src elisp
(after! evil-snipe
  (setq evil-snipe-scope 'visible
        evil-snipe-spillover-scope 'whole-visible))
#+end_src

** Other
These are things that I added at one point but I'm really not sure what is going
on
#+begin_src elisp
(setq projectile-project-search-path '("~/Dropbox/Graduate School/"
                                       "~/Dropbox/PhD Applications/"
                                       "~/Projects/"))
#+end_src
